Catalogs/упТипыРегламентныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыРегламентныхДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрефиксШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияДатыЭкземпляра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыОпределенияДатыДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияНомераЭкземпляра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыОпределенияНомераДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упСпособыОпределенияНомераДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыОпределенияНомераДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Номер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФормуле</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСпособыОпределенияДатыДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыОпределенияДатыДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФормуле</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыРегламентныхДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ФормулаНомер = ТекстФормулыПоУмолчанию();
		Объект.ФормулаДата 	= ТекстФормулыПоУмолчанию(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаблокироватьЭлементы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СпособОпределенияНомераЭкземпляраПриИзменении(Элемент)
	УстановитьДоступностьФормулыНомера();
КонецПроцедуры

&НаКлиенте
Процедура СпособОпределенияДатыЭкземпляраПриИзменении(Элемент)
	УстановитьДоступностьФормулыДаты();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УстановитьДоступностьФормулыНомера()
	   Элементы.ФормулаНомер.Доступность = Объект.СпособОпределенияНомераЭкземпляра = ПредопределенноеЗначение("ПеречислениЕ.упСпособыОпределенияНомераДокумента.ПоФормуле");
КонецПроцедуры
   
&НаКлиенте
Процедура УстановитьДоступностьФормулыДаты()
	   Элементы.ФормулаДата.Доступность = Объект.СпособОпределенияДатыЭкземпляра = ПредопределенноеЗначение("ПеречислениЕ.упСпособыОпределенияДатыДокумента.ПоФормуле");
КонецПроцедуры   

&НаКлиенте
Процедура ЗаблокироватьЭлементы()
	УстановитьДоступностьФормулыДаты();
	УстановитьДоступностьФормулыНомера();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстФормулыПоУмолчанию(ЭтоНомер = Истина)
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("// Допускается использовать значения переменных: ДокументОснование, Номер, НомерКИС, Дата, ДатаКИС.");
		
	Если ЭтоНомер Тогда
		Текст.ДобавитьСтроку("НомерЭкземпляра = """";");
	Иначе
		Текст.ДобавитьСтроку("ДатаЭкземпляра = """";");	
	КонецЕсли;

	Возврат Текст.ПолучитьТекст();
КонецФункции

#КонецОбласти
